 [
    {
        "title": "Star Wars: Episode I - The Phantom Menace",
        "episode_number": "1",
        "main_characters": [
            "Qui-Gon Jinn",
            "Obi-Wan Kenobi",
            "Anakin Skywalker",
            "Padmé Amidala",
            "Jar Jar Binks",
            "Darth Maul"
        ],
        "description": "Obi-Wan Kenobi (Ewan McGregor) is a young apprentice Jedi knight under the tutelage of Qui-Gon Jinn (Liam Neeson) ; Anakin Skywalker (Jake Lloyd), who will later father Luke Skywalker and become known as Darth Vader, is just a 9-year-old boy. When the Trade Federation cuts off all routes to the planet Naboo, Qui-Gon and Obi-Wan are assigned to settle the matter.",
        "poster": "https://vignette.wikia.nocookie.net/starwars/images/7/75/EPI_TPM_poster.png/revision/latest?cb=20130822171446",
        "hero_image": "star_wars_episode_1_hero.jpg"
    },
    {
        "title": "Star Wars: Episode II - Attack of the Clones",
        "episode_number": "2",
        "main_characters": [
            "Obi-Wan Kenobi",
            "Anakin Skywalker",
            "Count Dooku",
            "Padmé Amidala",
            "Mace Windu",
            "Yoda",
            "Jango Fett",
            "Supreme Chancellor Palpatine"
        ],
        "description": "Ten years after the 'Phantom Menace' threatened the planet Naboo, Padmé Amidala is now a Senator representing her homeworld. A faction of political separatists, led by Count Dooku, attempts to assassinate her. There are not enough Jedi to defend the Republic against the threat, so Chancellor Palpatine enlists the aid of Jango Fett, who promises that his army of clones will handle the situation. Meanwhile, Obi-Wan Kenobi continues to train the young Jedi Anakin Skywalker, who fears that the Jedi code will forbid his growing romance with Amidala.",
        "poster": "https://vignette.wikia.nocookie.net/starwars/images/d/dd/Attack-Clones-Poster.jpg/revision/latest?cb=20180318125654",
        "hero_image": "star_wars_episode_2_hero.jpg"
    },
    {
        "title": "Star Wars: Episode III - Revenge of the Sith",
        "episode_number": "3",
        "main_characters": [
            "Obi-Wan Kenobi",
            "Anakin Skywalker",
            "Count Dooku",
            "Padmé Amidala",
            "Mace Windu",
            "Yoda",
            "C-3PO",
            "Supreme Chancellor Palpatine"
        ],
        "description": "Three years after the onset of the Clone Wars; the noble Jedi Knights are spread out across the galaxy leading a massive clone army in the war against the Separatists. After Chancellor Palpatine is kidnapped, Jedi Master Obi-Wan Kenobi and his former Padawan, Anakin Skywalker, are dispatched to eliminate the evil General Grievous. Meanwhile, Anakin's friendship with the Chancellor arouses suspicion in the Jedi Order, and dangerous to the Jedi Knight himself. When the sinister Sith Lord, Darth Sidious, unveils a plot to take over the galaxy, the fate of Anakin, the Jedi order, and the entire galaxy is at stake. Upon his return, Anakin Skywalker's wife Padme Amidala is pregnant, but he is having visions of her dying in childbirth. Anakin Skywalker ultimately turns his back on the Jedi, thus completing his journey to the dark side and his transformation into Darth Vader. Obi-Wan Kenobi must face his former apprentice in a ferocious lightsaber duel on the fiery world of Mustafar.",
        "poster": "https://vignette.wikia.nocookie.net/starwars/images/e/e7/EPIII_RotS_poster.png/revision/latest?cb=20130822174232",
        "hero_image": "star_wars_episode_3_hero.jpg"
    },
    {
        "title": "Solo: A Star Wars Story",
        "episode_number": "null",
        "main_characters": [
            "Han Solo",
            "Chewbacca",
            "Lando Calrissian",
            "Qi'ra",
            "Beckett",
            "L3-37",
            "Dryden Vos",
            "Darth Maul"
        ],
        "description": "Young Han Solo finds adventure when he joins forces with a gang of galactic smugglers and a 190-year-old Wookie named Chewbacca. Indebted to the gangster Dryden Vos, the crew devises a daring plan to travel to the mining planet Kessel to steal a batch of valuable coaxium. In need of a fast ship, Solo meets Lando Calrissian, the suave owner of the perfect vessel for the dangerous mission -- the Millennium Falcon.",
        "poster": "https://vignette.wikia.nocookie.net/starwars/images/a/a9/Solo_A_Star_Wars_Story_Theatrical_Poster.png/revision/latest?cb=20180409011120",
        "hero_image": "star_wars_episode_3_hero.jpg"
    },
    {
        "title": "Rogue One: A Star Wars Story",
        "episode_number": "",
        "main_characters": [
            "Jyn Erso",
            "Cassian Andor",
            "Orson Krennic",
            "K-2SO",
            "Chirrut Imwe",
            "L3-37",
            "Baze Malbus",
            "Bodhi Rook",
            "Saw Gerrera",
            "Darth Vader"
        ],
        "description": "Former scientist Galen Erso lives on a farm with his wife and young daughter, Jyn. His peaceful existence comes crashing down when the evil Orson Krennic takes him away from his beloved family. Many years later, Galen becomes the Empire's lead engineer for the most powerful weapon in the galaxy, the Death Star. Knowing that her father holds the key to its destruction, Jyn joins forces with a spy and other resistance fighters to steal the space station's plans for the Rebel Alliance.",
        "poster": "https://vignette.wikia.nocookie.net/starwars/images/f/f5/Rogue_One_A_Star_Wars_Story_theatrical_poster.png/revision/latest?cb=20161012214043",
        "hero_image": "star_wars_episode_3_hero.jpg"
    },
    {
        "title": "Star Wars: Episode IV - A New Hope",
        "episode_number": "4",
        "main_characters": [
            "Luke Skywalker",
            "Han Solo",
            "Princess Leia Organa",
            "Ben Kenobi",
            "Darth Vader",
            "C-3P0",
            "R2-D2",
            "Chewbacca"
        ],
        "description": "Part IV in George Lucas' epic, Star Wars: A New Hope opens with a Rebel ship being boarded by the tyrannical Darth Vader. The plot then follows the life of a simple farm boy, Luke Skywalker, as he and his newly met allies (Han Solo, Chewbacca, Obi-Wan Kenobi, C-3PO, R2-D2) attempt to rescue a Rebel leader, Princess Leia, from the clutches of the Empire. The conclusion is culminated as the Rebels, including Skywalker and flying ace Wedge Antilles make an attack on the Empire's most powerful and ominous weapon, the Death Star.",
        "poster": "https://vignette.wikia.nocookie.net/starwars/images/0/06/Star_Wars_Style_A_poster_1977.jpg/revision/latest?cb=20100708051712",
        "hero_image": "star_wars_episode_4_hero.jpg"
    },
    {
        "title": "Star Wars: Episode V - The Empire Strikes Back",
        "episode_number": "5",
        "main_characters": [
            "Luke Skywalker",
            "Han Solo",
            "Princess Leia Organa",
            "Darth Vader",
            "C-3P0",
            "R2-D2",
            "Chewbacca",
            "Lando Calrissian",
            "Boba Fett"
        ],
        "description": "Fleeing the evil Galactic Empire, the Rebels abandon their new base in an assault with the Imperial AT-AT walkers on the ice world of Hoth. Princess Leia, Han Solo, Chewbacca and the droid C-3PO escape in the Millennium Falcon, but are later captured by Darth Vader on Bespin. Meanwhile, Luke Skywalker and the droid R2-D2 follows Obi-Wan Kenobi's posthumous command, and receives Jedi training from Master Yoda on the swamp world of Dagobah. Will Skywalker manage to rescue his friends from the Dark Lord?",
        "poster": "https://vignette.wikia.nocookie.net/starwars/images/e/e4/Empire_strikes_back_old.jpg/revision/latest?cb=20161114072554",
        "hero_image": "star_wars_episode_5_hero.jpg"
    },
    {
        "title": "Star Wars: Episode VI - Return of the Jedi",
        "episode_number": "6",
        "main_characters": [
            "Luke Skywalker",
            "Han Solo",
            "Princess Leia Organa",
            "Darth Vader",
            "C-3P0",
            "Chewbacca",
            "The Emperor",
            "Boba Fett"
        ],
        "description": "Darth Vader and the Empire are building a new, indestructible Death Star. Meanwhile, Han Solo has been imprisoned, and Luke Skywalker has sent R2-D2 and C-3PO to try and free him. Princess Leia - disguised as a bounty hunter - and Chewbacca go along as well. The final battle takes place on the moon of Endor, with its natural inhabitants, the Ewoks, lending a hand to the Rebels. Will Darth Vader and the Dark Side overcome the Rebels and take over the universe?",
        "poster": "https://vignette.wikia.nocookie.net/starwars/images/b/b2/ReturnOfTheJediPoster1983.jpg/revision/latest?cb=20170926193831",
        "hero_image": "star_wars_episode_6_hero.jpg"
    },
    {
        "title": "Star Wars: Episode VII - The Force Awakens",
        "episode_number": "7",
        "main_characters": [
            "Kylo Ren",
            "Han Solo",
            "General Leia Organa",
            "Rey",
            "Poe Dameron",
            "Chewbacca",
            "Finn",
            "Luke Skywalker",
            "BB-8"
        ],
        "description": "Thirty years after the defeat of the Galactic Empire, Han Solo (Harrison Ford) and his young allies face a new threat from the evil Kylo Ren (Adam Driver) and the First Order.",
        "poster": "https://vignette.wikia.nocookie.net/starwars/images/f/fd/Star_Wars_Episode_VII_The_Force_Awakens.jpg/revision/latest?cb=20151018162823",
        "hero_image": "star_wars_episode_6_hero.jpg"
    },
    {
        "title": "Star Wars: Episode VIII - The Last Jedi",
        "episode_number": "8",
        "main_characters": [
            "Kylo Ren",
            "General Leia Organa",
            "Rey",
            "Poe Dameron",
            "Chewbacca",
            "Finn",
            "Luke Skywalker",
            "BB-8",
            "Supreme Leader Snoke"
        ],
        "description": "Luke Skywalker's peaceful and solitary existence gets upended when he encounters Rey, a young woman who shows strong signs of the Force. Her desire to learn the ways of the Jedi forces Luke to make a decision that changes their lives forever. Meanwhile, Kylo Ren and General Hux lead the First Order in an all-out assault against Leia and the Resistance for supremacy of the galaxy.",
        "poster": "https://vignette.wikia.nocookie.net/starwars/images/f/fe/TheLastJediTheatricalPoster.jpeg/revision/latest?cb=20171010002420",
        "hero_image": "star_wars_episode_6_hero.jpg"
    },
    {
        "title": "Star Wars: Episode IX - The Rise Of Skywalker",
        "episode_number": "9",
        "main_characters": [
            "Kylo Ren",
            "Han Solo",
            "General Leia Organa",
            "Rey",
            "Poe Dameron",
            "Chewbacca",
            "Finn",
            "Luke Skywalker",
            "BB-8",
            "C-3P0",
            "Emperor Palpatine"
        ],
        "description": "When it's discovered that the evil Emperor Palpatine did not die at the hands of Darth Vader, the rebels must race against the clock to find out his whereabouts. Finn and Poe lead the Resistance to put a stop to the First Order's plans to form a new Empire, while Rey anticipates her inevitable confrontation with Kylo Ren.",
        "poster": "https://vignette.wikia.nocookie.net/starwars/images/4/4c/TROSOneSheet.jpg/revision/latest?cb=20191022091806",
        "hero_image": "star_wars_episode_6_hero.jpg"
    }
]